# **SQL Local connection**

In [1]:
1+1

2

In [ ]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.3.0-cp312-cp312-win_amd64.whl.metadata (7.7 kB)
Downloading mysql_connector_python-9.3.0-cp312-cp312-win_amd64.whl (16.4 MB)
   ---------------------------------------- 0.0/16.4 MB ? eta -:--:--
   ---------------------------------------- 0.0/16.4 MB ? eta -:--:--
    --------------------------------------- 0.3/16.4 MB ? eta -:--:--
   - -------------------------------------- 0.5/16.4 MB 1.2 MB/s eta 0:00:14
   - -------------------------------------- 0.8/16.4 MB 1.1 MB/s eta 0:00:15
   -- ------------------------------------- 1.0/16.4 MB 1.1 MB/s eta 0:00:15
   --- ------------------------------------ 1.3/16.4 MB 1.0 MB/s eta 0:00:15
   --- ------------------------------------ 1.3/16.4 MB 1.0 MB/s eta 0:00:15
   --- ------------------------------------ 1.6/16.4 MB 1.0 MB/s eta 0:00:15
   ---- ----------------------------------- 1.8/16.4 MB 996.7 kB/s eta 0:00:15
   ----- ---------------------------------- 2.1/16.4 MB 1.0 MB/s eta 0:00:15
   ----- ---------------------------------- 2.4/16.4 MB 1.0 MB/s eta 0:00:14
   ----- ---------------------------------- 2.4/16.4 MB 1.0 MB/s eta 0:00:14
   ------ --------------------------------- 2.6/16.4 MB 1.0 MB/s eta 0:00:14
   ------- -------------------------------- 2.9/16.4 MB 992.6 kB/s eta 0:00:14
   ------- -------------------------------- 3.1/16.4 MB 1.0 MB/s eta 0:00:14
   -------- ------------------------------- 3.4/16.4 MB 1.0 MB/s eta 0:00:13
   -------- ------------------------------- 3.4/16.4 MB 1.0 MB/s eta 0:00:13
   -------- ------------------------------- 3.7/16.4 MB 1.0 MB/s eta 0:00:13
   --------- ------------------------------ 3.9/16.4 MB 1.0 MB/s eta 0:00:13
   ---------- ----------------------------- 4.2/16.4 MB 1.0 MB/s eta 0:00:13
   ---------- ----------------------------- 4.5/16.4 MB 1.0 MB/s eta 0:00:12
   ---------- ----------------------------- 4.5/16.4 MB 1.0 MB/s eta 0:00:12
   ----------- ---------------------------- 4.7/16.4 MB 1.0 MB/s eta 0:00:12
   ------------ --------------------------- 5.0/16.4 MB 1.0 MB/s eta 0:00:12
   ------------ --------------------------- 5.2/16.4 MB 1.0 MB/s eta 0:00:12
   ------------- -------------------------- 5.5/16.4 MB 1.0 MB/s eta 0:00:11
   -------------- ------------------------- 5.8/16.4 MB 1.0 MB/s eta 0:00:11
   -------------- ------------------------- 5.8/16.4 MB 1.0 MB/s eta 0:00:11
   -------------- ------------------------- 6.0/16.4 MB 1.0 MB/s eta 0:00:11
   --------------- ------------------------ 6.3/16.4 MB 1.0 MB/s eta 0:00:11
   ---------------- ----------------------- 6.6/16.4 MB 1.0 MB/s eta 0:00:10
   ---------------- ----------------------- 6.8/16.4 MB 1.0 MB/s eta 0:00:10
   ---------------- ----------------------- 6.8/16.4 MB 1.0 MB/s eta 0:00:10
   ----------------- ---------------------- 7.1/16.4 MB 1.0 MB/s eta 0:00:10
   ----------------- --------------------- 7.3/16.4 MB 1,000.0 kB/s eta 0:00:10
   ------------------ --------------------- 7.6/16.4 MB 999.5 kB/s eta 0:00:09
   ------------------- -------------------- 7.9/16.4 MB 1.0 MB/s eta 0:00:09
   ------------------- -------------------- 8.1/16.4 MB 1.0 MB/s eta 0:00:09
   ------------------- -------------------- 8.1/16.4 MB 1.0 MB/s eta 0:00:09
   -------------------- ------------------- 8.4/16.4 MB 1.0 MB/s eta 0:00:08
   --------------------- ------------------ 8.7/16.4 MB 1.0 MB/s eta 0:00:08
   --------------------- ------------------ 8.9/16.4 MB 1.0 MB/s eta 0:00:08
   ---------------------- ----------------- 9.2/16.4 MB 1.0 MB/s eta 0:00:08
   ----------------------- ---------------- 9.4/16.4 MB 1.0 MB/s eta 0:00:07
   ----------------------- ---------------- 9.4/16.4 MB 1.0 MB/s eta 0:00:07
   ----------------------- ---------------- 9.7/16.4 MB 999.9 kB/s eta 0:00:07
   ------------------------ --------------- 10.0/16.4 MB 1.0 MB/s eta 0:00:07
   ------------------------ --------------- 10.2/16.4 MB 1.0 MB/s eta 0:00:07
   ------------------------- -------------- 10.5/16.4 MB 1.0 MB/s eta 0:00:06
   ------------------------- -------------- 10.5/16.4 MB 1.0 MB/s eta 0:00:06
   -------------------------- ------------- 10.7/16.4 MB 1.0 MB/s eta 0:00:06
   -------------------------- ------------- 11.0/16.4 MB 1.0 MB/s eta 0:00:06
   --------------------------- ------------ 11.3/16.4 MB 995.2 kB/s eta 0:00:06
   ---------------------------- ----------- 11.5/16.4 MB 996.4 kB/s eta 0:00:05
   ---------------------------- ----------- 11.5/16.4 MB 996.4 kB/s eta 0:00:05
   ---------------------------- ----------- 11.8/16.4 MB 998.9 kB/s eta 0:00:05
   ---------------------------- --------- 12.1/16.4 MB 1,000.0 kB/s eta 0:00:05
   ------------------------------ --------- 12.3/16.4 MB 998.4 kB/s eta 0:00:05
   ------------------------------ --------- 12.6/16.4 MB 996.8 kB/s eta 0:00:04
   ------------------------------ --------- 12.6/16.4 MB 996.8 kB/s eta 0:00:04
   ------------------------------- -------- 12.8/16.4 MB 996.7 kB/s eta 0:00:04
   -------------------------------- ------- 13.1/16.4 MB 998.8 kB/s eta 0:00:04
   -------------------------------- ------- 13.4/16.4 MB 999.8 kB/s eta 0:00:03
   --------------------------------- ------ 13.6/16.4 MB 998.4 kB/s eta 0:00:03
   --------------------------------- ------ 13.9/16.4 MB 997.0 kB/s eta 0:00:03
   --------------------------------- ------ 13.9/16.4 MB 997.0 kB/s eta 0:00:03
   ---------------------------------- ----- 14.2/16.4 MB 998.0 kB/s eta 0:00:03
   --------------------------------- ---- 14.4/16.4 MB 1,000.0 kB/s eta 0:00:02
   ----------------------------------- ---- 14.7/16.4 MB 999.7 kB/s eta 0:00:02
   ------------------------------------ --- 14.9/16.4 MB 997.4 kB/s eta 0:00:02
   ------------------------------------ --- 14.9/16.4 MB 997.4 kB/s eta 0:00:02
   ------------------------------------- -- 15.2/16.4 MB 996.1 kB/s eta 0:00:02
   ------------------------------------- -- 15.5/16.4 MB 997.0 kB/s eta 0:00:01
   -------------------------------------- - 15.7/16.4 MB 997.8 kB/s eta 0:00:01
   ---------------------------------------  16.0/16.4 MB 996.7 kB/s eta 0:00:01
   ---------------------------------------  16.3/16.4 MB 996.5 kB/s eta 0:00:01
   ---------------------------------------- 16.4/16.4 MB 989.6 kB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.3.0

In [ ]:
import mysql.connector

In [ ]:
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="MySql@2024!",
    database="school_db"
)

In [ ]:
cursor = conn.cursor()

In [ ]:
cursor.execute("SELECT * FROM students")

In [ ]:
print(cursor.fetchall())

[(1, 'Ahmed Hassan', 88, 'ahmed88@gmail.com'), (2, 'Mona Adel', 91, 'mona.adel@gmail.com'), (3, 'Youssef Gamal', 76, 'youssef.gamal@gmail.com'), (4, 'Aya', 92, 'Aya.yoyo@gmail.com')]

In [ ]:
cursor.execute("SELECT * FROM students")

for row in cursor:
    print(row)

(1, 'Ahmed Hassan', 88, 'ahmed88@gmail.com')
(2, 'Mona Adel', 91, 'mona.adel@gmail.com')
(3, 'Youssef Gamal', 76, 'youssef.gamal@gmail.com')
(4, 'Aya', 92, 'Aya.yoyo@gmail.com')

## INSERT

In [ ]:
name = input("Enter student name: ")
grade = int(input("Enter grade: "))
email = input("Enter email: ")

cursor.execute(
    "INSERT INTO students (name, grade, email) VALUES (%s, %s, %s)",
    (name, grade, email)
)

Enter student name: Ali
Enter grade: 60
Enter email: Ali.aloo@gmail.com

In [ ]:
cursor.execute("SELECT * FROM students")

for row in cursor:
    print(row)

(1, 'Ahmed Hassan', 88, 'ahmed88@gmail.com')
(2, 'Mona Adel', 91, 'mona.adel@gmail.com')
(3, 'Youssef Gamal', 76, 'youssef.gamal@gmail.com')
(4, 'Aya', 92, 'Aya.yoyo@gmail.com')
(5, 'Ali', 60, 'Ali.aloo@gmail.com')

In [ ]:
conn.commit()

## UPDATE

In [ ]:
student_id = int(input("Enter student ID to update: "))
new_grade = int(input("Enter new grade: "))

cursor.execute(
    "UPDATE students SET grade = %s WHERE id = %s",
    (new_grade, student_id)
)

conn.commit()

Enter student ID to update: 1
Enter new grade: 98

In [ ]:
cursor.execute("SELECT * FROM students")

for row in cursor:
    print(row)

(1, 'Ahmed Hassan', 98, 'ahmed88@gmail.com')
(2, 'Mona Adel', 91, 'mona.adel@gmail.com')
(3, 'Youssef Gamal', 76, 'youssef.gamal@gmail.com')
(4, 'Aya', 92, 'Aya.yoyo@gmail.com')
(5, 'Ali', 60, 'Ali.aloo@gmail.com')

## SELECT with WHERE

In [ ]:
threshold = int(input("Show students with grade > ? "))

cursor.execute("SELECT name, grade FROM students WHERE grade > %s", (threshold,))
rows = cursor.fetchall()

for row in rows:
    print(row)

Show students with grade > ? 90
('Ahmed Hassan', 98)
('Mona Adel', 91)
('Aya', 92)

## Pandas

In [1]:
import pandas as pd

In [ ]:
query = "SELECT * FROM students"
df = pd.read_sql(query, conn)

C:\Users\AMIT\AppData\Local\Temp\ipykernel_2268\1600143320.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [ ]:
print("📊 Students Table:")
df.head()

📊 Students Table:

   id           name  grade                    email
0   1   Ahmed Hassan     88        ahmed88@gmail.com
1   2      Mona Adel     91      mona.adel@gmail.com
2   3  Youssef Gamal     76  youssef.gamal@gmail.com
3   4            Aya     92       Aya.yoyo@gmail.com

## SQLAlchemy

In [ ]:
!pip install sqlalchemy pymysql

Requirement already satisfied: sqlalchemy in c:\users\amit\anaconda3\lib\site-packages (2.0.34)
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\amit\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amit\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [12]:
from sqlalchemy import create_engine

In [ ]:
  conn.close()

In [13]:
engine = create_engine("mysql+pymysql://root:MySql@2024!@localhost:3306/school_db")

In [ ]:
# df = pd.read_sql("SELECT * FROM students", engine) error

In [ ]:
# df.head()

   id           name  grade                    email
0   1   Ahmed Hassan     98        ahmed88@gmail.com
1   2      Mona Adel     91      mona.adel@gmail.com
2   3  Youssef Gamal     76  youssef.gamal@gmail.com
3   4            Aya     92       Aya.yoyo@gmail.com
4   5            Ali     60       Ali.aloo@gmail.com

In [3]:
from urllib.parse import quote_plus

In [4]:
raw_password = "MySql@2024!"

In [5]:
password = quote_plus(raw_password)

In [6]:
password

'MySql%402024%21'

In [ ]:
engine = create_engine(f"mysql+pymysql://root:{password}@localhost:3306/school_db")

In [ ]:
df = pd.read_sql("SELECT * FROM students", engine)
df.head()

   user_id username           email  age
0        1     alex  alex@gmail.com   24
1        2     lina  lina@yahoo.com   22

## Task 🌟

* Insert sample data into bookstore_db from Python using SQLAlchemy

In [2]:
from sqlalchemy import create_engine, text

In [5]:
password = quote_plus("MySql@2024!")
engine = create_engine(f"mysql+pymysql://root:{password}@localhost:3306/bookstore_db")

In [6]:
with engine.begin() as conn:
    conn.execute(text("""
        INSERT INTO categories (category_name) VALUES
        ('Science Fiction'), ('Biography'), ('Business');
    """))

    conn.execute(text("""
        INSERT INTO books (title, price, category_id) VALUES
        ('The Martian',150.00, 1),
        ('Elon Musk Biography', 200.00, 2),
        ('Steve Jobs Biography', 210.00, 2),
        ('Start With Why', 120.00, 3);
    """))

    conn.execute(text("""
        INSERT INTO orders (book_id, quantity, order_date) VALUES
        (1, 2, '2024-06-01'),
        (2, 1, '2024-06-02'),
        (3, 3, '2024-06-03');
    """))

In [7]:
print("✅ Sample data inserted into bookstore_db successfully.")

✅ Sample data inserted into bookstore_db successfully.

Task 1: Show all tables and their contents

In [10]:
tables = ['categories', 'books', 'orders']
for table in tables:
    print(f"\n=== {table.upper()} ===")
    display(pd.read_sql(f"SELECT * FROM {table}", engine))

=== CATEGORIES ===

   category_id    category_name
0            1  Science Fiction
1            2        Biography
2            3         Business
3            4  Science Fiction
4            5        Biography
5            6         Business

=== BOOKS ===

   book_id                 title  price  category_id
0        1           The Martian  150.0            1
1        2   Elon Musk Biography  200.0            2
2        3  Steve Jobs Biography  210.0            2
3        4        Start With Why  120.0            3
4        5           The Martian  150.0            1
5        6   Elon Musk Biography  200.0            2
6        7  Steve Jobs Biography  210.0            2
7        8        Start With Why  120.0            3

=== ORDERS ===

   order_id  book_id  quantity  order_date
0         1        1         2  2024-06-01
1         2        2         1  2024-06-02
2         3        3         3  2024-06-03
3         4        1         2  2024-06-01
4         5        2         1  2024-06-02
5         6        3         3  2024-06-03

Task 2: JOIN books with categories

In [ ]:
df = pd.read_sql("""
SELECT b.book_id, b.title, b.price, c.category_name
FROM books b
JOIN categories c ON b.category_id = c.category_id
""", engine)
display(df)

   book_id                 title  price    category_name
0        1           The Martian  150.0  Science Fiction
1        5           The Martian  150.0  Science Fiction
2        2   Elon Musk Biography  200.0        Biography
3        3  Steve Jobs Biography  210.0        Biography
4        6   Elon Musk Biography  200.0        Biography
5        7  Steve Jobs Biography  210.0        Biography
6        4        Start With Why  120.0         Business
7        8        Start With Why  120.0         Business

Task 3: Show orders with book titles and total price

In [12]:
df = pd.read_sql("""
SELECT o.order_id, b.title, o.quantity, b.price, (o.quantity * b.price) AS total_price
FROM orders o
JOIN books b ON o.book_id = b.book_id
""", engine)
display(df)

   order_id                 title  quantity  price  total_price
0         1           The Martian         2  150.0        300.0
1         2   Elon Musk Biography         1  200.0        200.0
2         3  Steve Jobs Biography         3  210.0        630.0
3         4           The Martian         2  150.0        300.0
4         5   Elon Musk Biography         1  200.0        200.0
5         6  Steve Jobs Biography         3  210.0        630.0

Task 4: Show books priced above 150

In [13]:
df = pd.read_sql("SELECT * FROM books WHERE price > 150", engine)
display(df)

   book_id                 title  price  category_id
0        2   Elon Musk Biography  200.0            2
1        3  Steve Jobs Biography  210.0            2
2        6   Elon Musk Biography  200.0            2
3        7  Steve Jobs Biography  210.0            2

Task 5: Count of books in each category

In [16]:
df = pd.read_sql("""
SELECT c.category_name, COUNT(b.book_id) AS book_count
FROM books b
JOIN categories c ON b.category_id = c.category_id
GROUP BY c.category_name
""", engine)
display(df)

     category_name  book_count
0  Science Fiction           2
1        Biography           4
2         Business           2

Task 6: Total quantity ordered per book

In [17]:
df = pd.read_sql("""
SELECT b.title, SUM(o.quantity) AS total_quantity
FROM orders o
JOIN books b ON o.book_id = b.book_id
GROUP BY b.title
""", engine)
display(df)

                  title  total_quantity
0           The Martian             4.0
1   Elon Musk Biography             2.0
2  Steve Jobs Biography             6.0

Task 7: Books with 'Biography' in title

In [20]:
df = pd.read_sql("SELECT * FROM books WHERE title LIKE '%%Biography%%'", engine)
display(df)

   book_id                 title  price  category_id
0        2   Elon Musk Biography  200.0            2
1        3  Steve Jobs Biography  210.0            2
2        6   Elon Musk Biography  200.0            2
3        7  Steve Jobs Biography  210.0            2

Task 8: Orders between two dates

In [ ]:
df = pd.read_sql("""
SELECT * FROM orders
WHERE order_date BETWEEN '2024-06-01' AND '2024-06-03'
""", engine)
display(df)

   order_id  book_id  quantity  order_date
0         1        1         2  2024-06-01
1         2        2         1  2024-06-02
2         3        3         3  2024-06-03

Task 9: Books sorted by price descending

In [ ]:
df = pd.read_sql("SELECT * FROM books ORDER BY price DESC", engine)
display(df)

   book_id                title  price  category_id
0        2  Elon Musk Biography  200.0            2
1        1          The Martian  150.0            1
2        3       Start With Why  120.0            3

Task 10: Average book price per category

In [ ]:
df = pd.read_sql("""
SELECT c.category_name, AVG(b.price) AS avg_price
FROM books b
JOIN categories c ON b.category_id = c.category_id
GROUP BY c.category_name
""", engine)
display(df)

     category_name  avg_price
0  Science Fiction      150.0
1        Biography      200.0
2         Business      120.0

Task 11: Books in categories with more than 1 book

In [21]:
df = pd.read_sql("""
SELECT * FROM books
WHERE category_id IN (
    SELECT category_id FROM books GROUP BY category_id HAVING COUNT(*) > 1
)
""", engine)
display(df)

   book_id                 title  price  category_id
0        1           The Martian  150.0            1
1        2   Elon Musk Biography  200.0            2
2        3  Steve Jobs Biography  210.0            2
3        4        Start With Why  120.0            3
4        5           The Martian  150.0            1
5        6   Elon Musk Biography  200.0            2
6        7  Steve Jobs Biography  210.0            2
7        8        Start With Why  120.0            3

Task 12: Total orders per day

In [ ]:
df = pd.read_sql("""
SELECT order_date, COUNT(*) AS num_orders
FROM orders
GROUP BY order_date
""", engine)
display(df)

   order_date  num_orders
0  2024-06-01           2
1  2024-06-02           2
2  2024-06-03           2

 Task 13: Total revenue per category

In [ ]:
df = pd.read_sql("""
SELECT c.category_name, SUM(o.quantity * b.price) AS total_revenue
FROM orders o
JOIN books b ON o.book_id = b.book_id
JOIN categories c ON b.category_id = c.category_id
GROUP BY c.category_name
""", engine)
display(df)

     category_name  total_revenue
0  Science Fiction          600.0
1        Biography          400.0
2         Business          720.0

Task 14: Books that were never ordered

In [ ]:
df = pd.read_sql("""
SELECT * FROM books
WHERE book_id NOT IN (SELECT DISTINCT book_id FROM orders)
""", engine)
display(df)

   book_id                 title  price  category_id
0        4           The Martian  150.0            1
1        5   Elon Musk Biography  200.0            2
2        6  Steve Jobs Biography  210.0            2
3        7        Start With Why  120.0            3

Task 15: Detailed orders sorted by order date

In [22]:
df = pd.read_sql("""
SELECT o.order_id, o.order_date, b.title, c.category_name, o.quantity, b.price
FROM orders o
JOIN books b ON o.book_id = b.book_id
JOIN categories c ON  c.category_id = b.category_id
ORDER BY o.order_date ASC
""", engine)
display(df)

,order_id,order_date,title,category_name,quantity,price
0,1,2024-06-01,The Martian,Science Fiction,2,150.0
1,4,2024-06-01,The Martian,Science Fiction,2,150.0
2,2,2024-06-02,Elon Musk Biography,Biography,1,200.0
3,5,2024-06-02,Elon Musk Biography,Biography,1,200.0
4,3,2024-06-03,Steve Jobs Biography,Biography,3,210.0
5,6,2024-06-03,Steve Jobs Biography,Biography,3,210.0